{"/en/about/":{"data":{"":" My personal website, showing some of my professional interests and hobbies. Some used to be on my other website www.roya.org.\nIt has evolved over the years, starting in 1997 with the TextPattern CMS, then Grav, Lektor and now Hugo.\nIn 2010, I opened a woodworking shop, and some of my furniture is visible at L’air du bois\nMy other interests include embedded software\nhttps://github.com/fdesvallees"},"title":"About"},"/en/apps/":{"data":{"":"This section contains a few programs I wrote to emulate astronomy yearbooks such as the wonderful books from Guy Ottewell. They are written in JavaScript and use various free JS libraries."},"title":"Apps"},"/en/apps/planets/":{"data":{"":"Planets with their orbits. The Solar System objects are represented with THREE.js with a custom rendering engine based on Paper.js.\nIt is possible to load additional objects (using the “settings” page). The orbital elements for these comets and asteroids come from the Minor Planet Center.\nThe orbit computations are from Jean Meeus’ “Astronomical Algorithms”. Much of the code was adapted from Peter Hayes ephemeris."},"title":"Planets in 3D"},"/en/apps/skymap/":{"data":{"":"This sky map uses d3.js and paper.js to display the night sky.\nIt displays a projection of the night sky (stars down to magnitude 9, constellation lines, planets, brightest Messier and NGC objects). The star database derives from the astronomy nexus, and the constellation lines from the PP3 program.\nYou can zoom and drag the map, and hovering over a star displays its Draper catalog number and Bayer designation if available.\nThe amount of detail (ie the magnitude limit) depends on the zoom factor. At a certain level, we load tiles containing fainter stars, and unload them when zooming out or panning across the sky. This is described in a blog entry. To save memory and speed up loading, the constellation lines and boundaries are stored in TopoJSON, Mike Bostock’s utility for encoding topology."},"title":"Sky Map"},"/en/archive/":{"data":{"":"Miscellaneous old posts from my previous website at www.roya.org"},"title":"Archive"},"/en/archive/fontanalbe-february-2015/":{"data":{"":"\nNice weather and perfect snow through Fontanalbe (Vallée des Merveilles) - 1st February 2015."},"title":"Fontanalbe - February 2015"},"/en/archive/horse-trek-in-kyrgyzstan/":{"data":{"":"","#":"For several years my brother had been telling me about his horse treks in Kyrgyzstan, so this year I finally decided to accompany him and his friends, Bernard and Rose-Marie Repond, who have traveled extensively though Central Asia.\nWe traveled from France via Moscow, taking the daily Aeroflot flight that gets into Bishkek (the capital) in the middle of the night. There Ishen Obolbekov was waiting for us. Together with his wife Gulmira and his brother Rash, Ishen runs Shepherd’s way Trekking, a company that organizes horse treks in several mountain ranges throughout the country.\nGetting there We first drove from Bishkek to Naryn, where we spent the night in the guest house run by Celestial Mountains Tours, then to Tash Rabat, one of the best-preserved caravanserails from the Silk Road. In Tash Rabat we met our guides Toko and Esen, who had brought the horses by truck. After a few quick instructions on how to handle the horses (“tchi” to advance, “brrr” to stop) we were off to our first pass, 4000 meters high but not too hard, that led us to the southern side of Ak-Say range.\nDays 1-7 - Ak-Say Ak-Say is a range that runs from southwest to northeast near the Chinese border. Its northern side is drained by the Naryn river (the former Syr Darya), and the rivers on the southern side feed the Kakshaal river that flows into China. For a whole week we rode towards the north east, always above 3000 meters. Every day we met shepherds and marmot trappers from At Bashi, on the northern side of the range. Most spend only the summer on the south side, but some stay for the winter, a very cold prospect indeed. Wolves are just about the only distractions you can expect.\nDays 8-9 - The Ulan river After crossing the strategic road that leads to Chatir Kul lake (our only camp below 3000 meters), we started going up along the river Ulan. For one day we rode on the northern side of a long canyon of red earth, along a narrow trail several hundred meters above the river. I did not take pictures that day, for fear of losing the horse’s reins. The next day, after an easy pass at 4000 meters we descended the northern Ulan river, inside a narrow canyon of red mud where we had to dismount, and arrived at a lodge run by a hunting company. There are quite a few of these operators in Kyrgyzstan, who charge several thousand dollars for the right to kill endangered Marco Polo sheep.\nDays 10-11 - Up the Karakolka After a long afternoon up the Naryn river’s flat bed, we arrived at our planned meeting with Rash, who was bringing supplies for the rest of the trek. It was quite a logistical achievement for a party of horses to meet a truck exactly at the right time after 10 days, with no communications whatsoever. (Cell phone coverage is limited to the cities). The next day we started the trek up the Karakolka river, crossing it several times. This is where the skills of the horseman count : You cannot cross these fast-flowing rivers on foot, but horses can cross up to a depth of about one meter.\nDays 12-13 - The Chakyr Korum pass We camped at a site with a breathtaking view, just below a steep natural dam of white gravel. Toko announced with a big smile that we would be riding up this dam. Indeed the next day we started on foot, and entered a canyon of white rock, lined with vertical red cliffs. The canyon itself is impassable for horses, so we had another steep climb out of it, and arrived on the high plateau on the north side. After yet another long descent we camped on the bed of the Chakyr Korum river. The next day we climbed our last pass (Kara-Suu) at 4000 meters, and finally got to Kara Sai, where Rash was waiting for us with the truck. We had the good surprise to find a hot hammam in the hunter’s lodge.\n####Day 14 - The Ak Shirak canyon\nWe spent one day to travel by minibus to a spectacular canyon not far from the Chinese border. By that time the weather had changed and we did this under a snowstorm. We got back to Barskoon under a full moon up the “pass of Bones” at 4000 meters.\nBarskoon, Karakol and return Barskoon, by lake Issyk Kul at 1700 meters, was a welcome rest. We spent one day in nearby Karakol, a pleasant town with a fine museum commemorating general Przhevalsky, a 19th Russian explorer who lead several expeditions in eastern Siberia and China.\nWe had spent 14 days on horseback, riding 5 to 6 hours daily, and covered at least 300 kilometers. Even though this was my first time on a horse, I felt fine when arriving. The horses are very sure-footed, and the saddles (made of wood, but covered with a thick sheep skin) are quite comfortable.\nOverall this was a great experience, and I look forward to return to Kyrgyzstan, though perhaps for a shorter trek this time."},"title":"Horse Trek in Kyrgyzstan"},"/en/archive/kyoto/":{"data":{"":"\nScanned and uploaded my Kyoto pictures taken in my December trip to Japan. Rainy days give good colors, and the leaves were still nice and red."},"title":"Kyoto"},"/en/archive/la-fin-la-caravane-est-passee/":{"data":{"":"Je retransmets le message de Jean-Noël Fessy:\nC’est fini, quatre jours de vents violents des tempêtes d’équinoxe suivis des premières neiges ont eu raison de l’installation, ils l’ont couchée à quelques exceptions près. Le bœuf récalcitrant et ironiquement un pousseur de caddie se tiennent toujours debout, le drakkar est démâté, la sainte famille à terre, j’ai relevé vainement « le guide » à deux reprises. Elle aura tenu le temps prévu, l’été, mais elle n’a fait que passer au col de Tende la Caravane … Les lieux sentent l’hiver, moins hospitaliers mais toujours aussi puissants et beaux."},"title":"LA FIN, LA CARAVANE EST PASSÉE."},"/en/archive/mont-blanc-2000/":{"data":{"":"\nUploaded my Mont Blanc pictures"},"title":"Mont Blanc 2000"},"/en/archive/november-in-the-vallee-des-merveilles/":{"data":{"":"\nLast week-end I took a walk to Vallaurette, high in the Vallée des Merveilles. No snow yet, streams were not even frozen yet."},"title":"November in the Vallée des Merveilles"},"/en/archive/pictures-from-tende/":{"data":{"":"Uploaded some pictures from Tende"},"title":"Pictures from Tende"},"/en/archive/pictures-from-the-vallee-des-merveilles/":{"data":{"":"\nI uploaded some pictures from last year’s hikes in the Vallée des Merveilles."},"title":"Pictures from the Vallée des Merveilles"},"/en/astronomy/":{"data":{"":"My astronomy blog, describing my equipment, and showing my slow progress with astrophotography"},"title":"Astronomy"},"/en/astronomy/ap600/":{"data":{"":"I made a tripod and a TeenAstro controller for my “new” AP600 mount."},"title":"Astro-Physics AP600 mount"},"/en/astronomy/ap600_newpier/":{"data":{"":"\nImproved the pier for the AP600 mount. Stability is much improved, with excellent guiding accuracy (more on this later)"},"title":"Reinforced pier for Telescope"},"/en/astronomy/ap600_pier/":{"data":{"":"\nNew pier for my Astro-Physics 600 mount with TeenAstro controller"},"title":"Home-made wooden pier for telescope mount"},"/en/astronomy/arc-en-ciel/":{"data":{"":"\nNice rainbow today in Cagnes"},"title":"Rainbow"},"/en/astronomy/beautiful-thunderstorm-above-nice-yesterday/":{"data":{"":"\nLittle rain, but nice electrical show yesterday, July 7."},"title":"Beautiful thunderstorm above Nice yesterday"},"/en/astronomy/clair_de_lune_obiou/":{"data":{"":"\nGemini, Taurus and Orion over the Pic d’Obiou"},"title":"Moonlight over Obiou"},"/en/astronomy/cold_morning/":{"data":{"":"\nCold morning last december. Unfortunately I only had a heater around the guiding scope. The images turned out unusable. Time to get another heater!"},"title":"Cold morning"},"/en/astronomy/dew_heater_controller/":{"data":{"":"\nI wasted too many astrophoto evenings because of dew on the telescope lens.\nSo I added a heater controller in my power box (PCB on the right). Schematics copied from this site.\nNow I have a cool blinking LED on the mount."},"title":"Dew Heater Controller"},"/en/astronomy/eq_table-2/":{"data":{"":"\nThe table is finished. I added two struts and made a light varnish.\nFirst tests tonight with the binoculars, before I try the Dobson."},"title":"Equatorial table for my 12\" Dobson (2)"},"/en/astronomy/eq_table-3/":{"data":{"":"\nTesting the table for the Nuit des Etoiles.\nIt worked fine, allowing continuous viewing for the public, at least 15 minutes without readjusting the view."},"title":"Equatorial table for my 12\" Dobson (3)"},"/en/astronomy/eq_table/":{"data":{"":"\nI started this equatorial table, taking as a model the excellent articles by Reiner Vogel and Ed Jones. Here are the steps:\nWith two pieces of ash, I make a mortise and a tenon\nI cut a circle segment..\n.. which is routed with an angle of 43 degrees (my latitude)\n.. the resulting piece is cut lengthwise at an angle (difficult to determine - I used trial and error)\nthen assembled with a biscuit jointer.\nThe mobile part is ready to glue up.\nStarting to assemble the fixed part. I bought the DC motor, regulating circuit and reducing gear from conrad.fr\nDetail of the drive cylinder, made of wood covered with heat-shrink tubing for traction\nThe south pivot uses a window hinge\nThe north-east bearing\nFirst trials\nThe table is almost finished, with its electronic box and leveling screws."},"title":"Equatorial table for my 12\" Dobson"},"/en/astronomy/heart_nebula/":{"data":{"":"\nIC 1805: Heart Nebula Borg 90FL@F4, ASI533MC, 24x300sec\nUV/IR Filter\nAP600 mount with TeenAstro PixInsight, Affinity Photo, starnet++"},"title":"Heart Nebula"},"/en/astronomy/ic_1396/":{"data":{"":"\nIC 5146: Elephant Trunk Nebula in Cepheus\nBorg 90FL@F4, ASI533MC, 60x300sec\nUV/IR Filter Mount: Takahashi NJP with TeenAstro\nPixInsight, Starnet2"},"title":"IC 1396"},"/en/astronomy/ic_5146/":{"data":{"":"\nIC 5146: Cocoon Nebula in Cygnus\nBorg 90FL@F4, ASI533MC, 7x300sec\nUV/IR Filter\nPixInsight, Affinity Photo"},"title":"IC 5146"},"/en/astronomy/ic_5146_2/":{"data":{"":"\nIC 5146: Cocoon Nebula in Cygnus\nBorg 90FL@F4, ASI533MC, 48x300sec\nUV/IR Filter Mount: Astro-Physics 600 with TeenAstro\nPixInsight, Starnet2\nCompare with earlier version"},"title":"IC 5146"},"/en/astronomy/leo_triplet/":{"data":{"":"\nM65, M66 and NGC3628: Leo Triplet Borg 90FL@F4, ASI533MC, 24x300sec\nUV/IR Filter\nPixInsight"},"title":"Leo Triplet"},"/en/astronomy/lunar_eclipse/":{"data":{"":"Borg 90FL@F5.6, Nikon D750, 1 to 2 second exposures"},"title":"Lunar Eclipse - 16 may 2022"},"/en/astronomy/m101/":{"data":{"":"\nMessier 101 Galaxy (Pinwheel) in Ursa Major"},"title":"M101"},"/en/astronomy/m16/":{"data":{"":"\nM16: Eagle Nebula in Serpens Borg 90FL@F4, ASI533MC, 19x300sec\nUV/IR Filter\nPixInsight, Affinity Photo"},"title":"M16"},"/en/astronomy/m31/":{"data":{"":"\nM31: Andromeda Galaxy Nikkor 180mm@F4, ASI533MC, 48x300sec AP600 mount with TeenAstro\nUV/IR Filter\nPixInsight\nThis Nikkor lens is pretty good, but it leaves blue halos around bright stars. I need to find out how to get rid of them."},"title":"M31"},"/en/astronomy/m33/":{"data":{"":"\nM33: Triangulum Galaxy Borg 90FL@F4, ASI533MC, 30x300sec\nUV/IR Filter\nPixInsight, Affinity Photo"},"title":"M33"},"/en/astronomy/m45/":{"data":{"":"\nM45: The Pleiades Borg 90FL@F4, ASI533MC, 17x300sec\nUV/IR Filter\nPixInsight"},"title":"M45"},"/en/astronomy/m81_82/":{"data":{"":"\nM81 and M82: Bode’s Galaxies Borg 90FL@F4, ASI533MC, 24x300sec\nUV/IR Filter\nPixInsight"},"title":"Bode's Galaxies"},"/en/astronomy/markarian_chain/":{"data":{"":"\nNGC 4458: Markarian’s chain Borg 90FL@F4, ASI533MC, 24x300sec\nUV/IR Filter\nPixInsight"},"title":"Markarian's Chain"},"/en/astronomy/milkyway/":{"data":{"":"\nNikon D750, 20mm Nikon lens. 20x60s exposure, stacked in Affinity Photo"},"title":"Summer Milky Way"},"/en/astronomy/morning-planets/":{"data":{"":"\nMars, Saturn and Jupiter above the Grand Ferrand"},"title":"Morning Planets"},"/en/astronomy/nco-2015/":{"data":{"":"\nComme tous les deux ans, l’Observatoire de la Côte d’Azur organise la Nuit des Coupoles Ouvertes sur le plateau de Calern. Grosse affluence pour l’édition 2015, avec 3000 personnes."},"title":"Nuit Coupoles Ouvertes 2015"},"/en/astronomy/ngc4565/":{"data":{"":"\nNGC 4565 Galaxy in Coma Berenices"},"title":"NGC4565"},"/en/astronomy/ngc_2244/":{"data":{"":"\nNGC 2244: Rosette Nebula Borg 90FL@F4, ASI533MC, 48x300sec\nUV/IR Filter\nMount: Astro-Physics 600 with TeenAstro\nPixInsight, Starnet2\nCapture date: 14 Feb 2024\nCompare with same object captured and processed in 2020."},"title":"NGC 2244"},"/en/astronomy/ngc_281/":{"data":{"":"\nNGC 281: Pacman Nebula in Cassiopeia\nBorg 90FL@F5.6 with Lacerta LFF flattener, ASI533MC, 100x300sec\nUV/IR Filter Mount: Takahashi NJP with TeenAstro\nPixInsight, Starnet2"},"title":"NGC 281"},"/en/astronomy/ngc_6992/":{"data":{"":"\nNGC 6992 : Eastern Veil Nebula in Cygnus Borg 90FL@F4, ASI533MC, 20x300sec\nUV/IR Filter\nPixInsight, Affinity Photo, Starnet++"},"title":"NGC 6992 - Eastern Veil Nebula"},"/en/astronomy/ngc_7635/":{"data":{"":"\nNGC 7635: Bubble Nebula in Cassiopeia (top left), with NGC 7538 at bottom right Borg 90FL@F4, ASI533MC, 20x300sec\nUV/IR Filter\nPixInsight, Affinity Photo"},"title":"NGC 7635"},"/en/astronomy/ngc_7822/":{"data":{"":"\nNGC 7822: Emission nebula in Cepheus Borg 90FL@F4, ASI533MC, 24x300sec\nOptolong L-Extreme Filter\nPixInsight, Affinity Photo, Starnet++"},"title":"NGC 7822"},"/en/astronomy/njp/":{"data":{"":"The NJP Temma2 is a wonderful mount, with antique electronics. This shows how to upgrade it with a modern TeenAstro controller in a reversible way, without modifying any of the connectors. The original Temma2 electronics box is removed and replaced by a custom box.\nIt has a classical gear arrangement. Both RA and DEC axes have the same motor (NEMA17, 200 steps/rev), reducer (18:1) and gears (60:24). The RA axis wheel has 240 teeth, and the DEC has 144 teeth. The resulting gear ratios are:\nRA: 18 x 2.5 x 240 = 10800\nDEC: 18 x 2.5 x 144 = 6480\nThe encoders on the worm are ABN type with 300 pulses/rev. At sidereal speed, on the RA axis, we get one A/B pulse every 0.8333 second and one N pulse every 250 seconds.\nAt this time, I use a temporary aluminium plate with an external TeenAstro. Eventually it will be replaced by a small TeenAstro board attached to the mount.\nI made simple 4-wire adapters to plug the motors. The Temma2 has Rose connectors that are mechanically very close to similar Molex models. The encoders connectors have 6 pins at 1.27mm pitch. It is difficult, but possible to make an adapter to the easier 2.54mm pitch. However I have not yet figured out how Takahashi uses them. Of course they are not absolute, so they cannot be used like modern 10-Micron or Astrophysics mounts, but they might be used to improve tracking (more on this later).\nThe mount works fine. The original Temma2 electronics are rated to 350x. I set the maximum slewing speed to 420x, with 16 microsteps (no need to use a bigger value with such a high gear). In Motion Controller mode (SPI only), it would be possible to run faster, but this would push the motors way beyond their rated maximum speed."},"title":"Takahashi NJP"},"/en/astronomy/njp2/":{"data":{"":"body:\nI finished adapting a TeenAstro Main Unit version 2.5.4 to the NJP mount, with a custom wooden box."},"title":"Takahashi NJP (Integrated TeenAstro)"},"/en/astronomy/north_am_pelican/":{"data":{"":"\nNorth America Nebula and Pelican in the constellation Cygnus Nikkor 180mm@F4, ASI533MC, 42x300sec\nUV/IR Filter\nMount: Astro-Physics 600 with TeenAstro\nPixInsight, Starnet2\nCapture date: 29 Aug 2024"},"title":"North America Nebula"},"/en/astronomy/rosette_nebula/":{"data":{"":"\n19 March 2020\n6x300s - Nikon D750 - Borg 90FL / F4 - AP600 mount with TeenAstro controller - No filter"},"title":"NGC 2244 - Rosette Nebula"},"/en/astronomy/sadr_region/":{"data":{"":"\nSadr Region: H II region in the constellation Cygnus Nikkor 180mm@F4, ASI533MC, 42x300sec\nUV/IR Filter\nMount: Astro-Physics 600 with TeenAstro\nPixInsight, Starnet2\nCapture date: 27/28 Jul 2024"},"title":"Sadr Region"},"/en/astronomy/scope_enhancements/":{"data":{"":"\nNew finder scope (MiniBorg 50mm)\nFilter drawer - open position\nFilter drawer - with filter in place"},"title":"Enhancements for my Dobson Factory telescope"},"/en/astronomy/teenastro/":{"data":{"":"I made a new TeenAstro PCB to fix directly on the mount. Fewer wires, less clutter.\nThe Losmandy rail carries a power box and a Raspberry Pi 4 that controls the mount for astrophotography."},"title":"Box for TeenAstro mount controller"},"/en/astronomy/telescopes/":{"data":{"":"After my renewed interest in astronomy last year I joined a club, (SPICA in Cagnes sur Mer), which gives access to the 40cm Newton Amateur Telescope of the Côte d’Azur observatory in Calern, above Grasse.\nI also purchased, first a 6 inch Vixen Newton on GP2 mount, then a 30cm made by Pierre Desvaux / Dobson Factory) with a mirror from John Nichol.\nThen of course a few eyepieces: a 24mm Panoptic, an 11mm Nagler and a 5mm Takahashi LE.\nThe wooden Dobson design has the advantage of being easy to customize. Here is my setup for finding objects: a Rigel Quickfinder and Takahashi 6x30 optical finder. This combination works fine for me. No GOTO, no digital setting circles! just Erich Karkoschka’s Sky Observer’s Handbook, the 12inch mirror and a dark night."},"title":"Telescopes"},"/en/diagrams/":{"data":{"":"This section contains snippets of code representing my various programming interests over the years."},"title":"Diagrams"},"/en/diagrams/gibbon/":{"data":{"":"Another example of a d3 interactive chart.\nThe horizontal scale shows the pages (in my Modern Library edition), and the vertical scale shows the years described at each chapter.\nHover mouse over curve to display the chapter title, zoom in for detail.\nThe long vertical bars represent chapters that span a long period."},"title":"Gibbon's \"Decline and Fall of the Roman Empire\""},"/en/diagrams/gradient/":{"data":{"":"Both HTML5 canvas and SVG have a “gradient” construct. This is an attempt to represent a sunrise with a circular gradient."},"title":"Sunrise"},"/en/diagrams/hourglass/":{"data":{"":"All astronomy yearbooks display some form of “hourglass” diagram, that shows the times when Sun, Moon and planets rise and set.\nFinding the times for sunrise and sunset is easy enough, drawing the lines too. Coloring is more involved, but paper.js greatly helps."},"title":"Hourglass Diagram"},"/en/diagrams/mooncalendar/":{"data":{"":"Once we know the phase from the date, we draw one little moon for each day of the year."},"title":"Moon Calendar"},"/en/diagrams/ninaloganalyzer/":{"data":{"":"NINA is a program for controlling astrophoto equipment. It creates text logs that are difficult to read. This web page allows displaying the log in a graph. It is based on ideas from Brian Carter."},"title":"NINA Log Analyzer"},"/en/diagrams/planetpathecliptic/":{"data":{"":"Displays the path of a planet during a given time frame in an ecliptic projection."},"title":"Planet Path - Ecliptic projection"},"/en/diagrams/proustogram/":{"data":{"":"Exercise in using Mike Bostock’s D3 visualization framework.\nChronogram of Marcel Proust’s In Search of Lost Time, based on Jacques Darrieulat’s Chronoproust.\nEach volume is represented as a rectangle of width proportional to its size, with time on the vertical axis.\nThe first volume starts around the birth of the Narrator, and there is a 10-year gap between the last two. Famously, the last volume, Le temps retrouvé ends around 1926, when the Narrator decides to start writing. Proust himself had died in 1922….\nTry zooming in for more detail"},"title":"À la recherche du temps perdu"},"/en/diagrams/zodiac/":{"data":{"":"Displays Sun, Moon and planets, along with the constellations around the ecliptic in a rectangular projection."},"title":"Zodiac"},"/en/woodworking/":{"data":{"":"My woodworking blog"},"title":"Woodworking"},"/en/woodworking/-shoji-che/":{"data":{"":"\nI just finished this cabinet in cherry. It is already full of woodworking books and others. The wood is from a large cherry tree I felled 3 years ago. I got very nice planks for the top. The design is copied from a Seth Janofsky design, in a Krenov book (With Wakened Hands), except I used shoji paper for the doors instead of cedar."},"title":"Shoji cabinet"},"/en/woodworking/antique-furniture-restoration/":{"data":{"":"\nThe final parts of the school consisted of training with professional woodworkers. I chose to spend a month with Christian Aussel, a friendly antique restorer from Antibes who taught me the basics of grafting missing pieces, waxing and French Polish (“vernis au tampon”).\nThis strange-looking table with a veneered walnut top and solid walnut legs needed a new top, and several grafts on the pedestal. I took care of the grafts, while Christian did the top."},"title":"Antique Furniture Restoration"},"/en/woodworking/art-deco-bedstands/":{"data":{"":"\nI just finished these two bed stands in oak, with the same Art Déco style as my desk. Just like the desk, they are built with secret miter dovetails for strength."},"title":"Art Déco Bed Stands"},"/en/woodworking/art-deco-desk-continued/":{"data":{"":"\nThis was indeed a major glue-up. I used almost all my clamps. Notice the gluing blocks, to ensure pressure at right-angle to the miter. These are sawn-off after the glue has set, then the surface is planed and cleaned. Next come the drawers, two of which are mounted on knife hinges to pivot towards the outside."},"title":"Art Déco desk - continued"},"/en/woodworking/art-deco-desk-in-maple/":{"data":{"":"\nHere is another desk in maple in the spirit of Jean-Michel Frank."},"title":"Art Déco Desk in Maple"},"/en/woodworking/art-deco-desk-is-finished/":{"data":{"":"\nHere is the finished desk. The rotating drawers presented a special challenge. The laminating of the curved sides was actually pretty easy (I used ash sawn into 2mm-thick slices, then glued in a quarter-circle form), but the knife-hinges were difficult to adjust."},"title":"Art Déco desk is finished"},"/en/woodworking/art-deco-desk/":{"data":{"":"\nThe desk is finished. It looks good, although I am not sure whether the original design was veneered rather than built in solid wood. It required special attention to design, in order to allow seasonal wood movement without damage."},"title":"Art Deco Desk"},"/en/woodworking/built-my-frame-saw/":{"data":{"":"I need to resaw wide boards, and my band saw will only cut up to about 90 mm. After trying to use my big Ryoba with mixed success, I found how build a frame saw on this nice page, and made my own, not quite as neat, but it works. I used it to cut a 300mm wide board of basswood (linden, tilleul). Gives a good workout too.\nDetail of blind dovetail\nI used a 600mm Japanese Turbo Cut blade\nStarting the cut with the Ryoba\nFrame saw in action\nDone! Still need to clean up with the scrub plane, then jack plane."},"title":"Built my frame saw"},"/en/woodworking/butsudan/":{"data":{"":"\nA butsudan is a shrine used in Buddhist culture. This one is made with the same elm wood that I used for a coopered box. Difficult to work because it is so hard, but it has a wonderful color and grain."},"title":"Butsudan"},"/en/woodworking/cherry-and-walnut-boards/":{"data":{"":"I finished ripping (with the Logosol Timberjig and Stihl chainsaw) the walnut and cherry I cut this winter. The boards are now drying. I still have one ash to rip. "},"title":"Cherry and walnut boards"},"/en/woodworking/chest-of-drawers/":{"data":{"":"I finished my small cherry chest. It took me a year from the time I bought the wood (3 boards of cherry and 2 boards of lime) from a yard in Borgo San Dalmazzo (Piedmond, Italy). Since I have no planer / jointer or large bandsaw the most time-consuming part was to get all pieces to size. I do not use plywood, so the side panels and drawer bottoms took a lot of effort. The drawers are simple, flush to the front (well, almost flush…). They slide in T-shaped guides of hardwood (also cherry) that are tenoned into the frame. The drawer bottoms and the back of the chest are made of lime, about 10 mm thick.\nDetail of the dovetails (my first ones - can do better). The top is a thin panel inside a frame with mitered joints and through tenons. All the joints are hand-made. I prefer working a bit more slowly, but in silence. Also, it reduces the risk of injury (although I did cut off a bit of finger with a sharp chisel - must know when it’s too late to work….)\nI bought the handles in Nice - could not find the Japanese look I was wanted so I took ordinary brass ones.\nThe last step was to apply the finish (Tung oil and beeswax)\nOverall it does not look quite like what I wanted. The top is too thick, and the finish is a bit bland. My next piece will be better, with some curves. But first I will get a big bandsaw. (probably with 450mm wheels). Resawing these panels is just too hard.."},"title":"Chest of drawers"},"/en/woodworking/church-furniture/":{"data":{"":"\nI just finished an altar, pedestal for statue, and lectern for a nearby chapel.\nThe wood is solid walnut, the design is modern, using a coopered technique."},"title":"Church Furniture"},"/en/woodworking/console-table-in-ash/":{"data":{"":"\nHere is the last project I made at the school. I just finished it with shellack. It is in ash. The skirt is laminated, the feet were shaped with the bandsaw, and finished with spokeshave and file.\nAnother view:\nMy woodworking school term is nearing completion. This week I will finish the exam table, then I will work at 2 real woodworking shops for one month each, and get evaluated."},"title":"Console Table in ash"},"/en/woodworking/cutting-down-a-walnut-tree-for-furniture/":{"data":{"":"\nI cut down a walnut this month.\nNext steps: rip the logs into planks, let it dry for a year or two, then make furniture!"},"title":"Cutting down a walnut tree for furniture"},"/en/woodworking/delivered-and-installed-the-church-furniture/":{"data":{"":"\nToday I installed the 3 walnut pieces to the chapel in Antibes, southern France.\n(I didn’t carve the statue! anyway it is made of stucco, not wood)"},"title":"Delivered and installed the church furniture"},"/en/woodworking/desk-and-chair/":{"data":{"":"\nI recently finished a writing / drafting desk in maple (from a James Krenov design) and an ash chair in the spirit of the Giò Ponti Superleggera. The seat is weaved by hand and takes a lot of time and material. More pictures on my professional website at www.atelier-desvallees.com"},"title":"Desk and chair"},"/en/woodworking/elm-chest/":{"data":{"":"\nI just finished this box with coopered top. The wood is from elm that a local farmer cut down when they died from the elm disease 30 years ago. It is dry alright. Difficult to work though."},"title":"Elm Coopered Box"},"/en/woodworking/elm-coffee-table/":{"data":{"":"Remember the alder I cut last year?\nIt is now ready for making furniture. I used the first flitch to make a small coffee table, about 40 cm high. I wanted it to look special, so I chose to assemble with three-way miter joints (sanbo-tome-tsugi in Japanese). I found the design at this address\nAfter trying a mockup in larch, I chickened out and decided to use this joint only for the top (most visible) corners and to do the bottom corners with easier tenons. During the difficult assembly I almost gave up and recut everything smaller. In the end I decided to keep the first try, even though it has some flaws. The top is a single board cut that I cut in two thinner ones (using my frame saw!), then edge-glued for a nice symmetrical effect. Here it is. Overall I am happy with the result.\nDetail of the miter joint\nTotal cost for material: Wood: nothing. Bone glue: a few cents. Bee’s wax: maybe 20 cents. Number of hours? Cost of hand tools? please do not ask.))"},"title":"Alder Coffee Table"},"/en/woodworking/final-job-at-don-bosco/":{"data":{"":"\nBefore the school closes for summer vacation, I helped my teacher to build this large glassed cabinet. I cut the wood, dimensioned it, cut the tenons and mortises, shaped the arch with a router, and dry-assembled. My teacher did the spindle moulder job and final gluing."},"title":"Final job at Don Bosco"},"/en/woodworking/finished-desk-in-elm/":{"data":{"":"\nI just finished this desk in Elm for a friend. I bought the wood in Italy, it has a wonderful color and grain. Since the boards were 8cm thick (more than 3 inches), it took me a lot of work to resaw and bring to thickness.\nIt is composed of a table, and a chest of drawers. The table top has 2 parts joined at a right angle with a miter, reinforced with butterfly keys.\nThe chest has 4 drawers of progressive heights, assembled with dovetails. The back of the chest and the drawer bottoms are cedar."},"title":"Finished desk in Elm"},"/en/woodworking/krenov-style-smoothing-plane/":{"data":{"":"\nHere is a smoothing plane I made in olive wood. It works beautifully. Olive is a fine wood for planes, but when freshly cut, it has the property of corroding steel. (Even though the tree was felled over 20 years ago!) For a while, my blade (from Ron Hock) kept rusting quickly. It is okay now that the wood has aged a bit and lost some of its “juice”."},"title":"Krenov-style smoothing plane"},"/en/woodworking/major-additions-to-the-shop/":{"data":{"":"I finally decided to add 2 major equipments in my workshop: a good workbench and a big bandsaw. For the bench, I settled on a Anke “extra-schwer” (extra-heavy) model that I ordered through my friends at feine-werkzeuge in Berlin.\nThe bandsaw is a Scheppach Basato 5-2, that I got from a fine wood machinery specialist in nearby Busca, Piedmont, Italy. (A4 Alessandrini)\nBoth are heavy and required the help of several strong friends to carry them. Everything is installed and working good. Now I can really speed up my next project, a shoe cabinet I will make with the elm I cut 3 years ago. More details soon."},"title":"Major additions to the shop"},"/en/woodworking/maple-drawing-table/":{"data":{"":"\nI just made another Krenov-style maple drawing table."},"title":"Maple drawing table"},"/en/woodworking/my-first-2-weeks-at-don-bosco/":{"data":{"":"I decided to take a 1-year sabbatical leave from my regular job as a software engineer in the semiconductor industry to study woodworking. I chose a school in Nice called Don Bosco (After a 19th century priest from Turin, Italy, who took care of poor kids - Luckily the school is open to all religions and does not enforce any kind of religious teaching!).\nI have been there 2 weeks already, and I am very happy with the quality of the courses. There are 10 of us in the class (5 youngsters and 5 adults), with varying degrees of experience. Of course we start at the basics: sharpening, hand tools (chisels, saws, hand planes). The tools are provided by the school.\nHere are the first joints I made:\nTenons, mortises \u0026 half-laps - open\nTenons, mortises \u0026 half-laps - assembled\nDetail of corner mortise\nDetail of center mortise\nThis week we are learning how to use machines. We have a fine assortment, from sturdy old horizontal mortisers to recent, numerically-controlled tenoning machines, joiners and thicknessers, scary table saws and spindle-moulders."},"title":"My first 2 weeks at Don Bosco"},"/en/woodworking/new-additions-to-the-shop/":{"data":{"":"Even while I am studying at Don Bosco, I keep upgrading my shop:\nI got a small Dewalt planer / thicknesser. It handles boards up to 250 mm wide - Need to get a vacuum system soon, because I now spend too much time sweeping the floor.\nAlso, I made a router table, following advice from various websites, and especially the fine book by Yeung Chan (Classic Joints with Power Tools - recommended!)\nI put the big Freud router underneath\nDetail showing the fine aluminium router plate from Sauter Gmbh in Germany (I don’t like phenolic materials) and the nifty Freud bit height adjustment above the plate - no fumbling beneath the table!\nThe next, and probably last, machine I need is a table saw. I will probably get the Mafell Erika 85 push-pull saw. Expensive (German quality), but I think it is worth the expense."},"title":"New additions to the shop"},"/en/woodworking/opened-my-woodworking-business/":{"data":{"":"I just started my business making custom furniture. My professional website is http://www.atelier-desvallees.com My shop is in Cagnes sur Mer, near Nice, France."},"title":"Opened my woodworking business"},"/en/woodworking/oval-table-in-walnut-is-finished/":{"data":{"":"\nHere is the table after assembly."},"title":"Oval Table in Walnut is finished"},"/en/woodworking/oval-table-in-walnut/":{"data":{"":"\nMy customers had this old table top in walnut. They asked me to design a new base for it. After a few drawings, we settled on an oval base. I made this 1/4 scale model:\nAfter we were satisfied with the design, I went ahead with the curved apron in laminated walnut: Then I cut mortises and tenons, shaped the feet with the bandsaw, then cleaned them up with rasp and drawknife. Next step is the glue-up, then finishing etc."},"title":"Oval Table in Walnut"},"/en/woodworking/ripping-a-pear-tree/":{"data":{"":"\nA friend allowed me to saw his pear tree. I made 5 nice boards, about 1.30m long and 6cm thick. The widest are 40cm wide, with a wonderful pink color. We will see how it ages. Next step is in about 3 or 4 years, when it is dry enough to make furniture. Watch this space!"},"title":"Resawing a pear tree"},"/en/woodworking/schools-over/":{"data":{"":"\nThat’s it - We have completed our term at Don Bosco. The final week was hectic, since we had to make this table from scratch in just 6 days. This will be one of our grades (along with technical drawing and study of furniture styles, and the feedback from our industry trainings)\nI find the style (or rather lack of it awful. It is in solid ash, except the top and bottom boards, which are in veneered MDF. The top veneer has a square pattern that does not show in the picture. It opens on 2 hinges and contains a drawer with dovetails. The feet are bandsawed in a lyra shape (that’s the worst part in my view). Remember we did not choose the subject)\nThis week I started the first of my 2 one-month trainings in a real-life workshop. A friendly cabinet maker in my home town agreed to take me as an apprentice. There is certainly a change of pace compared to the school: I made 10 drawers the first day (starting from rough oak, I planed the boards, dimensioned them, cut dovetails with a special -purpose machine). The next day I glued them and fixed the screws. More on this later."},"title":"School's over!"},"/en/woodworking/sewing-box-in-elm/":{"data":{"":"\nFinished this sewing box in elm."},"title":"Sewing box in Elm"},"/en/woodworking/shoe-cabinet-close-to-completion/":{"data":{"":"I assembled and glued my shoe cabinet in alder (erle / aulne). The wood is not widely used because it is not very strong, but it has a beautiful yellow / orange color. The whole cabinet is solid wood. The back is pine, and the bottom is some left-over basswood (linden / tilleul) I owe the general shape to this fine cabinet I found years ago on the web, although mine is not as nice.\nThe doors and shelves are not yet done, and I still need to apply the finish (Tung oil and bee’s wax).\nDetail of the miter-joints of the top.\nWood button holding the top to the carcase."},"title":"Shoe Cabinet close to completion"},"/en/woodworking/shoe-cabinet-finished-and-installed/":{"data":{"":"\nThat’s it!. I think it looks good, although I could not match the panels like I wanted, because I did not have enough wood (I wasted quite a bit because of various mistakes while preparing the pieces).\nIt certainly does its job, we will see how well it ages. I already know I won’t do another large cabinet in alder again. The wood is not hard enough. It’s okay for panels, as long as the joint is concealed (I found a shrinkage of about 1% after finishing with tung oil, even through the wood had been carefully air-dried for almost 4 years). I will stick to cherry, walnut and ash.\n.jpg)"},"title":"Shoe cabinet finished and installed"},"/en/woodworking/shoji-revisited/":{"data":{"":"Finished the first of the three small screens at the top. These are made from larch, recycled from an old beam of a roof that was torn down. Larch is nice, perhaps close to Japanese cedar, although it has knots. Even if it does not show in the pictures, the screens are quite straight - I need to learn how to get rid of the barrel distortion of this camera."},"title":"Shoji Revisited"},"/en/woodworking/sideboard-in-walnut/":{"data":{"":"\nThis sideboard was made for a customer who has already a marble top. I used wood from a walnut I cut 3 years ago:"},"title":"Sideboard in Walnut"},"/en/woodworking/update-on-my-workshop-equipment/":{"data":{"":"I finally bought a table saw. I got the Mafell Erika 85, a very sturdy contractor’s saw. I like it because it is very light, and can be moved around my small workshop as needed. I built a sled copied from Yeung Chan’s fine book, since the Mafell sliding table is very expensive, and too bulky for my personal use.\nMafell Erika table saw, with home-made sled\nAll my machines. Clockwise from bottom: Mafell table saw, home-built router table, DeWalt planer / thicknesser, Scheppach bandsaw.\nI have everything I need, except the vacuum system, but that is due very soon. In my next update I will describe my shoe cabinet, which is now close to completion."},"title":"Update on my workshop equipment"},"/en/woodworking/update-on-the-woodworking-school/":{"data":{"":"After 2 busy months at Don Bosco, we have a week of vacation. We learned basic techniques with hand tools, then how to use machines (jointer, thicknesser, table saws, tenoning machine, shaper/moulder), with an emphasis on safety, then spent quite some time on veneering. This is not my favorite subject, but it is part of the course, and certainly teaches me to improve quality of finishing (my weak point!). Here are the exercises:\nThat’s me in the school workshop.\nA stool in ash, with top in veneered MDF.\nDetail of the same\nWe also spend 3 hours per week on technical drawing. This is quite unlike any mechanical drawings I did before, and I think it is unique to woodworking, since most drawings are done at a scale of 1:1, and all 3 views are superimposed on the same sheet. Difficult to read, but very useful to capture the construction details."},"title":"Update on the woodworking school"},"/en/woodworking/using-a-large-japanese-saw/":{"data":{"":"This saw is called a Temagori Nokogiri. I bought it from Dieter Schmid in Berlin. It has a 490 mm blade. I used it to cut an alder lengthwise. Each log (1.20 meter long) took me about 2 hours."},"title":"Using a large Japanese saw"},"/en/woodworking/using-the-logosol-timberjig/":{"data":{"":"After cutting and ripping 2 trees by hand over the last 2 years, I decided to work faster and with less effort, and bought the Logosol Timberjig, a chainsaw guide for ripping boards out of a log. My little 37cc Husqvarna was not up to the task so I upgraded to a powerful Stihl MS361. I was lucky to get permission to cut a big cherry tree (almost 60cm diameter at the base) that was dying. It is 30 minutes away from the nearest road, so I carried the gear on my back. Also, the terrain is quite steep, and treacherous to work on. After I felled the tree, and started bucking the trunk, the biggest log rolled down 10 meters into a small ravine.\nSo I had to get a GripHoist to pull it out. That must have been close to 300kg, the specified limit.\nNote the pink sealing paint on the end grain, to reduce checking. Then, following the instructions, I went and squared the log,\nThen I cut 6 nice boards out of it, each between 5 and 8 cm thick, 30cm wide, and 1.6 m long.\nAfter carrying all boards back to the road (30kg each, round-trip takes one hour!), the wood is now drying in a safe place. The whole enterprise took me most week-ends of this spring. I still have 3 logs to rip, but first I will take a rest."},"title":"Using the Logosol Timberjig"},"/en/woodworking/woodworking-course-with-david-charlesworth/":{"data":{"":"\nI just came back from Devon, England, where I followed an excellent course with David Charlesworth. I improved my skills at dovetails and drawer-making. This is in Hartland, in beautiful North Devon, where I had 2 weeks of fine weather. Recommended."},"title":"Woodworking Course with David Charlesworth"},"/en/woodworking/woodworking/":{"data":{"":"","#":"I have always been interested in woodworking. A long time ago I bought simple cheap power tools: a router, electric hand plane and circular saw, and tried making small tables and shelves. I stopped quickly, because my work was shoddy at best, and because I realized I did not want to spend my free time in a noisy and dusty environment. My problem with power tools is that I hate the noise, so I want to finish quickly, and of course I am not careful. Then last year I decided to make a Japanese-style sliding screen (Shoji) so I bought a book by Toshio Odate, and found sites like Dick and Dieter Schmid that sell tools, and started again, this time working mostly by hand.\nWood The first difficulty was to find suitable wood. Normally Shoji are made with fine cedar, which the local lumber yards do not have (I live near Nice, in southern France). Of the available woods, pine is too soft and spongy, oak is too brittle, so I settled on cherry. The yards here sell mostly to professionals, and normally sell a whole tree instead of individual boards. I was lucky to find a partially opened log with 3 boards (approx 2.6 meter long by 30cm wide, thickness 50mm) of acceptable quality. They were somewhat warped, but thick enough to get straight rails and stiles.\nPower Tools My only power tool is a small Ryobi band-saw. It only cuts up to 80mm, not enough for resawing boards, but sufficient for making my rails and stiles.\nHand Tools I started with a couple of saws (Dozuki and Ryoba, Japanese hand planes and chisels, then marking tools, etc. Together this adds up to a few hundred euros.\nWork details The most time-consuming and physical part is to get the wood down to size, with square corners. After cutting the boards with the bandsaw, I started with the scrub plane to get all parts reasonably straight, then used my trying plane and kanna to obtain the final sizes.\nMarking is quick, but requires a lot of care, and cutting tenons does too. Mortises are hard! Each one takes me about 15 minutes, and there are 6 per screen. Cutting the kumiko (lattice) is easier, but it all adds up…\nThe finished screen I bought the wood in April this year, and I only finished my 3 screens at Christmas, working in the evenings and some week-ends. Looking back, I did not know it would take me this long, but I am happy with the result, and I have learned a whole set of skills. My next challenge for 2006 is a cabinet, maybe copied from this pretty model by the Garakuta Workshop."},"title":"Woodworking - My First Shoji"},"/en/woodworking/working-on-new-art-deco-desk/":{"data":{"":"\nI have almost finished this desk for a customer, this time in oak. I chose to do hidden miter dovetails instead of biscuits. It requires more work, but I know for sure it will never open. The glue-up should be interesting.\nThe panel under the drawers is assembled with sliding dovetails at the front and back. Only the one at the front is glued, to allow for seasonal expansion of the top."},"title":"Working on new Art Déco desk"},"/en/woodworking/workshop-door-is-installed/":{"data":{"":"\nI made a door in chestnut for my workshop. It is 50 mm thick, and quite heavy. It absorbs most of the noise of my machines, so hopefully the neighbors will not hate me."},"title":"Workshop Door is installed"}}